'''
Пробелы
В предложение были добавлены лишние пробелы. Напишите функцию, которая будет принимать 
такое предложение и возвращать его же в исправленном виде.
'''

'''
Прямоугольник
Напишите функцию, которая будет принимать два числа: ширину и высоту прямоугольника и возвращает  перимертр и площадь
'''

'''
Буквы-подруги
Напишите функцию, которая будет принимать строку и две буквы. Функция должна проверять, всегда ли после первой переданной буквы идет вторая.
Например:

привет, пр ---> return True
привет, пт ---> return False

'''


'''
Сборка машинок
Вы занимаетесь сборкой игрушечных машинок. Каждая машинка должна иметь четыре колеса, один корпус и две фигурки человечков внутри.
Фнукция должна возвращать строку в виде машинки (многострочная строка)
'''


'''
Напишите функцию capitalize(), которая принимает слово из маленьких латинских букв и возвращает его же, меняя первую букву на большую.
Например, print(capitalize('word')) должно печатать слово Word.

На вход подаётся строка, состоящая из слов, разделённых одним пробелом. Слова состоят из маленьких латинских букв. Напечатайте исходную строку, сделав так, чтобы каждое слово начиналось с большой буквы. При этом используйте вашу функцию capitalize().

Напомним, что в Питоне есть функция ord(), которая по символу возвращает его код в таблице ASCII, и функция chr(), которая по коду символа возвращает сам символ. Например, ord('a') == 97, chr(97) == 'a'.
'''


'''
Создайте простейшую в мире функцию simple_func, а затем выведите на экран ее тип.
'''


'''
def func_1():
  def func_2():
    def func_3():
      print('OK')

не изменяя структуры кода, запусти func_3
'''


'''
Напишите функцию, которая будет генерировать случайный пароль. В пароле должно быть от 8 до 15 символов
'''

