# аналог игры фнаф
# контекст: небольшой офис. 2 двери (слева и справа)
# В игре есть батарейка с зарядкой 100%. Игроку нужно расходовать
# таким образом, чтобы дожить до 6 часов утра. Заряд батарейки расходуется, когда
# смотришь или меняешь камеры, когда используешь свет или закрываешь двери. 
# 
# Каждый ход игрок может выбрать одно из действий:
# 1) Закрыть дверь (левую или правую)
# 2) Открыть дверь (левую или правую)
# 3) включить свет (левая или правая дверь)
# 4) выключить свет (левая или правая дверь)
# 5) открыть камеру (5 камер)
# 
# в игре всего 5 аниматроников (4 часто показываются, 1 - редко)
# 
# проиграть игрок может если села батарейка или появился аниматроник и игрок его не увидел
# 
# в игре всего 5 ночей. Игра начинается в 12 часов ночи. 1 час длится 1.5 минуты
# Следующий день начинается в 12 ночи
# С каждым следующем днем аниматроники появляются чаще
# 
# 

